<template>
  <div class="row">
    <div class="col-12 pt-3">
      <h4>О проекте</h4>
      <p>
        <strong>Info 🎓 Math</strong> — это справочник по некоторым разделам
        Информатики и Математики, который можно использовать при подготовке к
        экзаменам
      </p>
      <p>
        Это
        <abbr title="Открытое программное обеспечение" class="initialism"
          >Open source</abbr
        >
        проект, и каждый желающий может внести изменения в справочник на
        <a
          href="https://github.com/mccrush/info"
          target="_blank"
          title="Fork on Github"
          >Github</a
        >
      </p>
      <!-- <p>
        Проект Info Math абсолютно бесплатен и всегда таким будет. Но вы можете
        поддержать команду разработчиков на Patreon
      </p> -->
    </div>
  </div>
</template>