<template>
  <div class="row">
    <div class="col-12 pt-3">
      <h4>Алгоритмы</h4>
      <p>
        <strong>Алгоритм</strong> — конечная совокупность точно заданных правил
        решения некоторого класса задач или набор инструкций, описывающих
        порядок действий исполнителя для решения определённой задачи
      </p>
      <h5>Свойства алгоритмов<small>*</small></h5>
      <p>
        <strong>Детерминированность</strong> (определенность) — предполагает
        получение однозначного результата вычислительного процecca при заданных
        исходных данных. Благодаря этому свойству процесс выполнения алгоритма
        носит механический характер
      </p>
      <p>
        <strong>Дискретность</strong> — поцесс решения задачи должен быть разбит
        на последовательность отдельных шагов-команд, которые выполняются одна
        за другой. Только после завершения одной команды начинается выполнение
        следующей
      </p>
      <p>
        <strong>Конечность</strong> — каждое из действий и весь алгоритм в целом
        обязательно завершаются
      </p>
      <p>
        <strong>Массовость</strong> — это свойство предполагает, что алгоритм
        должен быть пригоден для решения всех задач данного типа
      </p>
      <p>
        <strong>Результативность</strong> — согласно этому свойству, любой
        алгоритм должен завершаться конкретным результатом
      </p>
      <p>
        <small class="text-muted"
          >* Данный перечень свойств не является исчерпывающим</small
        >
      </p>
      <h5>Обозначение блок-схем <small>(блок в разработке)</small></h5>
    </div>
  </div>
</template>