<template>
  <div class="row">
    <div class="col-12 pt-3">
      <h4>Алгоритмы</h4>
      <p>
        <strong>Алгоритм</strong> — конечная совокупность точно заданных правил
        решения некоторого класса задач или набор инструкций, описывающих
        порядок действий исполнителя для решения определённой задачи
      </p>
      <h5>Свойства алгоритмов <small>(блок в разработке)</small></h5>
      <h5>Обозначение блок-схем <small>(блок в разработке)</small></h5>
    </div>
  </div>
</template>