<template>
  <div class="row">
    <div class="col-12 pt-3">
      <h4>Графы</h4>
      <p>
        <strong>Граф</strong> — математическая абстракция реальной системы
        объектов любой природы, обладающих парными связями. Граф как
        математический объект есть совокупность двух множеств — множества самих
        объектов, называемого множеством вершин и множеством их парных связей,
        называемой множеством рёбер
      </p>
      <h5>Характеристики графов <small>(блок в разработке)</small></h5>
    </div>
  </div>
</template>