<template>
  <div class="row">
    <div class="col-12 pt-3">
      <h4>Графы</h4>
      <p>
        <strong>Граф</strong> – математическая абстракция реальной системы
        объектов любой природы, обладающих парными связями. Граф как
        математический объект есть совокупность двух множеств – множество вершин
        и множеством ребер
      </p>
      <p>
        Граф, содержащий ребра между всеми парами вершин, является
        <strong>полным</strong>
      </p>
      <p>
        Встречаются такие графы, ребрам которых поставлено в соответствие
        конкретное числовое значение, они называются
        <strong>взвешенными графами</strong>, а это значение –
        <strong>весом ребра</strong>
      </p>
      <h5>Классификация графов <small>(блок в разработке)</small></h5>
      <h5>Способы представления графа <small>(блок в разработке)</small></h5>
      <hr />
    </div>
    <div class="col-12 pt-2">
      <GraphApp />
    </div>
  </div>
</template>

<script>
import GraphApp from '@/components/Graph/GraphApp'
export default {
  components: {
    GraphApp
  }
}
</script>